In [9]:
  
# importing pandas as pd
import pandas as pd
 
# Creating the dataframe
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

### Now we will add a new column called ‘Price’ to the dataframe. Set the price to 1500 if the ‘Event’ is ‘Music’ else 800.

### by looping

In [10]:
li=[]
for i in range(df.shape[0]):
    if(df['Event'][i]=='Music'):
        li.append(1500)
    else:
        li.append(800)
li

[1500, 800, 1500, 800, 800]

In [11]:
ser=pd.Series(li)
ser

0    1500
1     800
2    1500
3     800
4     800
dtype: int64

In [12]:
df['Price']=ser

In [13]:
df

         Date   Event  Price
0   11/8/2011   Music   1500
1   11/9/2011  Poetry    800
2  11/10/2011   Music   1500
3  11/11/2011  Comedy    800
4  11/12/2011  Poetry    800

### list comprehension

In [14]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [15]:
df['Price']=[1500 if(df['Event'][i]=='Music') else 800 for i in range(df.shape[0]) ]
df

         Date   Event  Price
0   11/8/2011   Music   1500
1   11/9/2011  Poetry    800
2  11/10/2011   Music   1500
3  11/11/2011  Comedy    800
4  11/12/2011  Poetry    800

#### Set the price to 1500 if the ‘Event’ is ‘Music’, 1200 if the ‘Event’ is ‘Comedy’ and 800 if the ‘Event’ is ‘Poetry’.

In [16]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [18]:
df['Price']=df['Event'].map({'Music':1500,'Comedy':1200,'Poetry':800})

In [19]:
df

         Date   Event  Price
0   11/8/2011   Music   1500
1   11/9/2011  Poetry    800
2  11/10/2011   Music   1500
3  11/11/2011  Comedy   1200
4  11/12/2011  Poetry    800

## Using lambda function

In [27]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

#### a new column ‘Priority’ is created based on the condition: if the ‘Event’ is ‘Music’, the priority is set to ‘High’, otherwise, it’s set to ‘Low’.

In [28]:
df['Priority']=df['Event'].map(lambda x:'High' if x=='Music' else 'Low')

In [29]:
df

         Date   Event Priority
0   11/8/2011   Music     High
1   11/9/2011  Poetry      Low
2  11/10/2011   Music     High
3  11/11/2011  Comedy      Low
4  11/12/2011  Poetry      Low

In [30]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [31]:
df['Priority']=df['Event'].apply(lambda x:'High' if x=='Music' else 'Low')

In [32]:
df

         Date   Event Priority
0   11/8/2011   Music     High
1   11/9/2011  Poetry      Low
2  11/10/2011   Music     High
3  11/11/2011  Comedy      Low
4  11/12/2011  Poetry      Low

## Using DataFrame.loc[] function

#### we’ll create a new column called ‘Genre’ based on the ‘Event’ column. If the ‘Event’ is ‘Music’, the ‘Genre’ will be set to ‘Rock’; if it’s ‘Poetry’, the ‘Genre’ will be set to ‘Literary’; otherwise, it will be set to ‘Other’

In [42]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [43]:
df['Genre']='other'
df

         Date   Event  Genre
0   11/8/2011   Music  other
1   11/9/2011  Poetry  other
2  11/10/2011   Music  other
3  11/11/2011  Comedy  other
4  11/12/2011  Poetry  other

In [44]:
df.loc[df['Event']=='Music','Genre']='Rock'
df.loc[df['Event']=='Poetry','Genre']='Literary'
df

         Date   Event     Genre
0   11/8/2011   Music      Rock
1   11/9/2011  Poetry  Literary
2  11/10/2011   Music      Rock
3  11/11/2011  Comedy     other
4  11/12/2011  Poetry  Literary

In [47]:
df.loc[df['Event']=='Music','Genre']

0    Rock
2    Rock
Name: Genre, dtype: object

## Using Assign() function

### df.assign()
assign new columns to df
returns neq object with exisiting columns in addition to newly added columns.
if existing columns are reassigned will overwrite the values

In [48]:
df=pd.DataFrame({'a':[18,20],'b':[19,21]})
df

    a   b
0  18  19
1  20  21

In [49]:
df.assign(c=lambda x:x['a']*2)

    a   b   c
0  18  19  36
1  20  21  40

### adding multiple columns

In [51]:
df.assign(d=df['a']*2,e=df['a']*3)

    a   b   d   e
0  18  19  36  54
1  20  21  40  60

### reassigning existing column

In [52]:
df.assign(a=df['a']*2)

    a   b
0  36  19
1  40  21

In [77]:
df.assign(c=34)

         Date   Event   c
0   11/8/2011   Music  34
1   11/9/2011  Poetry  34
2  11/10/2011   Music  34
3  11/11/2011  Comedy  34
4  11/12/2011  Poetry  34

In [72]:
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

#### we’ll create a ‘Category’ column with values ‘Entertainment’ for ‘Music’ and ‘Comedy’ events, and ‘Literature’ for ‘Poetry’ events:

In [69]:
#df.assign(Category=lambda x:'Entertainment' if x.loc[:,x['Event']] in ('Music','Comedy') else 'Comedy')

In [81]:
for i in range(len(df)):
    if (df.loc[i,'Event'] == 'Music') or (df.loc[i,'Event'] == 'Comedy'):
        df.assign(Category='Entertainment')
    else:
        df.assign(Category='Literature')

In [84]:
df.assign(Category=['Entertainment' if ((df.loc[i,'Event'] == 'Music') or (df.loc[i,'Event'] == 'Comedy')) else 'Literature' for i in range(len(df))])

         Date   Event       Category
0   11/8/2011   Music  Entertainment
1   11/9/2011  Poetry     Literature
2  11/10/2011   Music  Entertainment
3  11/11/2011  Comedy  Entertainment
4  11/12/2011  Poetry     Literature

In [54]:
condition=df['Event'].isin(['Music','Comedy'])
condition

0     True
1    False
2     True
3     True
4    False
Name: Event, dtype: bool

In [83]:
condition = df['Event'].isin(['Music', 'Comedy'])
df = df.assign(Category=lambda x: 'Entertainment' if condition.any() else 'Literature')
 
# Display the updated DataFrame
print(df)

         Date   Event       Category
0   11/8/2011   Music  Entertainment
1   11/9/2011  Poetry  Entertainment
2  11/10/2011   Music  Entertainment
3  11/11/2011  Comedy  Entertainment
4  11/12/2011  Poetry  Entertainment

In [60]:
df=pd.DataFrame({'a':[18,20],'b':[19,21]})
df

    a   b
0  18  19
1  20  21

In [66]:

if df.loc[0,'a'] in (12,13,18):
    print('yes')
else:
    print('no')

yes